app/Controllers/Dashboard.php

    public function index()
    {
        $totalStok = $this->stokModel->getStokTersedia();
        $totalProdusen = $this->produsenModel->countAll();
---
SELECT COUNT(*) AS `numrows` FROM `produsen`