app/Controllers/Pemusnahan.php

    public function create()
    {
        $stokExpired = $this->stokModel->where('status', 'tersedia')
                                      ->where('tanggal_expired <', date('Y-m-d'))
                                      ->findAll();

        $stokRusak = $this->stokModel->where('status', 'tersedia')
                                    ->findAll();
---
SELECT *
FROM `stok`
WHERE `status` = 'tersedia'
AND `tanggal_expired` < '2025-11-29'