app/Models/DistribusiModel.php

    public function getDistribusiWithDetails($search = '', $perPage = 10)
    {
        $builder = $this->select('distribusi.*, stok.no_kantong, stok.gol_dar, stok.jenis_darah, rumah_sakit.nama_rs')
                       ->join('stok', 'stok.id_bag = distribusi.id_bag')
                       ->join('rumah_sakit', 'rumah_sakit.id_rs = distribusi.id_rs');

        if ($search) {
            $builder->groupStart()
                   ->like('stok.no_kantong', $search)
                   ->orLike('rumah_sakit.nama_rs', $search)
                   ->orLike('distribusi.penerima', $search)
                   ->orLike('distribusi.no_permintaan', $search)
                   ->groupEnd();
        }

        $builder->orderBy('distribusi.tanggal_distribusi', 'DESC');

        return [
            'distribusi' => $builder->paginate($perPage),
            'pager' => $this->pager
        ];
---
SELECT COUNT(*) AS `numrows`
FROM `distribusi`
JOIN `stok` ON `stok`.`id_bag` = `distribusi`.`id_bag`
JOIN `rumah_sakit` ON `rumah_sakit`.`idrs` = `distribusi`.`idrs`
SELECT `distribusi`.*, `stok`.`no_kantong`, `stok`.`gol_dar`, `stok`.`jenis_darah`, `rumah_sakit`.`nama_rs`
FROM `distribusi`
JOIN `stok` ON `stok`.`id_bag` = `distribusi`.`id_bag`
JOIN `rumah_sakit` ON `rumah_sakit`.`idrs` = `distribusi`.`idrs`
ORDER BY `distribusi`.`tanggal_distribusi` DESC
 LIMIT 10

    public function getTotalDistribusi()
    {
        return $this->countAll();
---
SELECT COUNT(*) AS `numrows` FROM `distribusi`

    public function getDistribusiHariIni()
    {
        return $this->where('DATE(tanggal_distribusi)', date('Y-m-d'))->countAllResults();
---
SELECT COUNT(*) AS `numrows`
FROM `distribusi`
WHERE DATE(tanggal_distribusi) = '2025-11-29'

    public function getDistribusiBulanIni()
    {
        return $this->where('MONTH(tanggal_distribusi)', date('m'))
                   ->where('YEAR(tanggal_distribusi)', date('Y'))
                   ->countAllResults();
---
SELECT COUNT(*) AS `numrows`
FROM `distribusi`
WHERE MONTH(tanggal_distribusi) = '11'
AND YEAR(tanggal_distribusi) = '2025'

    public function getRecentDistribusi($limit = 5)
    {
        return $this->select('distribusi.*, stok.no_kantong, stok.gol_dar, rumah_sakit.nama_rs')
                   ->join('stok', 'stok.id_bag = distribusi.id_bag')
                   ->join('rumah_sakit', 'rumah_sakit.id_rs = distribusi.id_rs')
                   ->orderBy('distribusi.tanggal_distribusi', 'DESC')
                   ->limit($limit)
                   ->get()
                   ->getResultArray();
---
SELECT `distribusi`.*, `stok`.`no_kantong`, `stok`.`gol_dar`, `rumah_sakit`.`nama_rs`
FROM `distribusi`
JOIN `stok` ON `stok`.`id_bag` = `distribusi`.`id_bag`
JOIN `rumah_sakit` ON `rumah_sakit`.`idrs` = `distribusi`.`idrs`
ORDER BY `distribusi`.`tanggal_distribusi` DESC
 LIMIT 5