app/Models/PemusnahanModel.php

SELECT COUNT(*) AS `numrows`
FROM `pemusnahan`
JOIN `stok` ON `stok`.`id_bag` = `pemusnahan`.`id_bag`
SELECT `pemusnahan`.*, `stok`.`no_kantong`, `stok`.`gol_dar`, `stok`.`jenis_darah`, `stok`.`tanggal_expired`
FROM `pemusnahan`
JOIN `stok` ON `stok`.`id_bag` = `pemusnahan`.`id_bag`
ORDER BY `pemusnahan`.`tanggal_pemusnahan` DESC
 LIMIT 10
---
    public function getPemusnahanWithDetails($search = '', $perPage = 10)
    {
        $builder = $this->select('pemusnahan.*, stok.no_kantong, stok.goldar, stok.jenisdarah, stok.tanggal_expired')
                       ->join('stok', 'stok.idbag = pemusnahan.idbag');

        if ($search) {
            $builder->groupStart()
                   ->like('stok.no_kantong', $search)
                   ->orLike('pemusnahan.alasan', $search)
                   ->orLike('pemusnahan.petugas', $search)
                   ->groupEnd();
        }

        $builder->orderBy('pemusnahan.tanggal_pemusnahan', 'DESC');

        $data = [
            'pemusnahan' => $builder->paginate($perPage),
            'pager' => $this->pager
        ];

SELECT COUNT(*) AS `numrows` FROM `pemusnahan`
---
    public function getTotalPemusnahan()
    {
        return $this->countAll();