app/Models/ReturnModel.php

SELECT COUNT(*) AS `numrows`
FROM `return_darah`
JOIN `stok` ON `stok`.`id_bag` = `return_darah`.`id_bag`
JOIN `rumah_sakit` ON `rumah_sakit`.`idrs` = `return_darah`.`idrs`
JOIN `distribusi` ON `distribusi`.`iddistribusi` = `return_darah`.`iddistribusi`
---
    public function getReturnWithDetails($search = '', $perPage = 10)
    {
        $builder = $this->select('return_darah.*, stok.no_kantong, stok.gol_dar, stok.jenis_darah, rumah_sakit.nama_rs, distribusi.tanggal_distribusi, distribusi.penerima')
                       ->join('stok', 'stok.id_bag = return_darah.id_bag')
                       ->join('rumah_sakit', 'rumah_sakit.id_rs = return_darah.id_rs')
                       ->join('distribusi', 'distribusi.id_distribusi = return_darah.id_distribusi');

        if ($search) {
            $builder->groupStart()
                   ->like('stok.no_kantong', $search)
                   ->orLike('rumah_sakit.nama_rs', $search)
                   ->orLike('return_darah.alasan_return', $search)
                   ->orLike('return_darah.ditangani_oleh', $search)
                   ->groupEnd();
        }

        $builder->orderBy('return_darah.tanggal_retur', 'DESC');

        $data = [
            'return' => $builder->paginate($perPage),
            'pager' => $this->pager
        ];