app/Models/RumahSakitModel.php

SELECT *
FROM `rumah_sakit`
WHERE `is_active` = 1
 LIMIT 10
SELECT COUNT(*) AS `numrows`
FROM `rumah_sakit`
WHERE `is_active` = 1
---
    public function getRumahSakit($search = '', $perPage = 10)
    {
        // Check whether the `is_active` column exists in the table.
        $fields = [];
        try {
            $fields = $this->db->getFieldNames($this->table);
        } catch (\Exception $e) {
            $fields = [];
        }

        $hasIsActive = in_array('is_active', $fields);

        // Use the model instance as the query builder so paginate() works.
        $builder = $this;

        if ($hasIsActive) {
            $builder = $builder->where('is_active', 1);
        }

        if ($search) {
            $builder->groupStart()
                   ->like('nama_rs', $search)
                   ->orLike('jenis_rs', $search)
                   ->orLike('telepon', $search)
                   ->groupEnd();
        }

        return [
            'rumah_sakit' => $builder->paginate($perPage),
            'pager' => $builder->pager
        ];