app/Models/StokModel.php

    public function getStokWithDetails($search = '', $perPage = 10)
    {
        $builder = $this->select('stok.*, produsen.nama as nama_produsen, produsen.jenis as jenis_produsen')
                       ->join('produsen', 'produsen.id_produsen = stok.id_produsen');

        if ($search) {
            $builder->groupStart()
                   ->like('stok.no_kantong', $search)
                   ->orLike('stok.gol_dar', $search)
                   ->orLike('stok.jenis_darah', $search)
                   ->orLike('produsen.nama', $search)
                   ->groupEnd();
        }

        $builder->orderBy('stok.tanggal_expired', 'ASC');

        $data = [
            'stok' => $builder->paginate($perPage),
            'pager' => $this->pager
        ];
---
SELECT COUNT(*) AS `numrows`
FROM `stok`
JOIN `produsen` ON `produsen`.`id_produsen` = `stok`.`id_produsen`
SELECT `stok`.*, `produsen`.`nama` as `nama_produsen`, `produsen`.`jenis` as `jenis_produsen`
FROM `stok`
JOIN `produsen` ON `produsen`.`id_produsen` = `stok`.`id_produsen`
ORDER BY `stok`.`tanggal_expired` ASC
 LIMIT 10

    public function getStokTersedia()
    {
        return $this->where('status', 'tersedia')->countAllResults();
---
SELECT COUNT(*) AS `numrows`
FROM `stok`
WHERE `status` = 'tersedia'

    public function getStokByGolongan()
    {
        return $this->select('gol_dar, COUNT(*) as total')
                   ->where('status', 'tersedia')
                   ->groupBy('gol_dar')
                   ->get()
                   ->getResultArray();
---
SELECT `gol_dar`, COUNT(*) as total
FROM `stok`
WHERE `status` = 'tersedia'
GROUP BY `gol_dar`

    public function getStokByJenis()
    {
        return $this->select('jenis_darah, COUNT(*) as total')
                   ->where('status', 'tersedia')
                   ->groupBy('jenis_darah')
                   ->get()
                   ->getResultArray();
---
SELECT `jenis_darah`, COUNT(*) as total
FROM `stok`
WHERE `status` = 'tersedia'
GROUP BY `jenis_darah`

    public function getStokMendekatiExpired()
    {
        $date = date('Y-m-d');
        $expiredDate = date('Y-m-d', strtotime('+7 days'));

        return $this->where('status', 'tersedia')
                   ->where('tanggal_expired >=', $date)
                   ->where('tanggal_expired <=', $expiredDate)
                   ->countAllResults();
---
SELECT COUNT(*) AS `numrows`
FROM `stok`
WHERE `status` = 'tersedia'
AND `tanggal_expired` >= '2025-11-29'
AND `tanggal_expired` <= '2025-12-06'

    public function getStokExpired()
    {
        return $this->where('status', 'tersedia')
                   ->where('tanggal_expired <', date('Y-m-d'))
                   ->countAllResults();
---
SELECT COUNT(*) AS `numrows`
FROM `stok`
WHERE `status` = 'tersedia'
AND `tanggal_expired` < '2025-11-29'